mlp2relu_relu
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_5 (Dense)              (None, 1024)              269312    
_________________________________________________________________
dense_6 (Dense)              (None, 1)                 1025      
=================================================================
Total params: 270,337
Trainable params: 270,337
Non-trainable params: 0
_________________________________________________________________
