mlp2tanh_tanh
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_3 (Dense)              (None, 1024)              269312    
_________________________________________________________________
dense_4 (Dense)              (None, 1)                 1025      
=================================================================
Total params: 270,337
Trainable params: 270,337
Non-trainable params: 0
_________________________________________________________________
