mlp4relu_relu
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_9 (Dense)              (None, 1024)              269312    
_________________________________________________________________
dense_10 (Dense)             (None, 256)               262400    
_________________________________________________________________
dense_11 (Dense)             (None, 64)                16448     
_________________________________________________________________
dense_12 (Dense)             (None, 1)                 65        
=================================================================
Total params: 548,225
Trainable params: 548,225
Non-trainable params: 0
_________________________________________________________________
