mlp1tanh_tanh
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_4 (Dense)              (None, 64)                16832     
_________________________________________________________________
dense_5 (Dense)              (None, 1)                 65        
=================================================================
Total params: 16,897
Trainable params: 16,897
Non-trainable params: 0
_________________________________________________________________
