mlp2linear_linear
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 1024)              269312    
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 1025      
=================================================================
Total params: 270,337
Trainable params: 270,337
Non-trainable params: 0
_________________________________________________________________
