slp_None
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 1)                 263       
=================================================================
Total params: 263
Trainable params: 263
Non-trainable params: 0
_________________________________________________________________
