mlp4selu_selu
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_13 (Dense)             (None, 1024)              269312    
_________________________________________________________________
dense_14 (Dense)             (None, 256)               262400    
_________________________________________________________________
dense_15 (Dense)             (None, 64)                16448     
_________________________________________________________________
dense_16 (Dense)             (None, 1)                 65        
=================================================================
Total params: 548,225
Trainable params: 548,225
Non-trainable params: 0
_________________________________________________________________
